app/Controllers/Home.php

DELETE FROM `edukasi`
WHERE `id` IN ('7')
---
        public function delete($id)
        {
            $this->EdukasiModel->delete($id);

UPDATE `edukasi` SET `judul` = 'Air Hangat', `deskripsi` = 'Untuk mandi', `foto` = ''
WHERE `edukasi`.`id` IN ('1')
---
        public function updateedukasiweb($id){

            $judul = $this->request->getPost('judul');
            $deskripsi = $this->request->getPost('deskripsi');
            $foto = $this->request->getFile('foto');


            $newName = '';
            if ($foto->isValid() && !$foto->hasMoved()) {
                $newName = $foto->getName();
                $foto->move(ROOTPATH . 'public/edukasi/');
            }

            $data = array(
                'judul' =>$judul,
                'deskripsi' => $deskripsi,
                'foto' => $newName
            );

           $result = $this->EdukasiModel->update($id,$data);