app/Models/ModelUser.php

    public function ceknomor($nomor)
    {
        return $this->where('nomor', $nomor)
            ->get();
---
SELECT *
FROM `user`
WHERE `nomor` = '123456789'

    public function getById($id)
    {
        return $this->where(['id' => $id])->get();
---
SELECT *
FROM `user`
WHERE `id` = '1'