app/Models/ModelEdukasi.php

    public function getEdukasi()
    {
        return $this->get();
---
SELECT *
FROM `edukasi`

    public function insert_edukasi($data)
    {
        return $this->db->table($this->table)->insert($data);
---
INSERT INTO `edukasi` (`judul`, `deskripsi`, `foto`) VALUES ('Masuk kan?', 'Enak gak?', 'Screenshot_20241125-133217.jpg')

    public function getById($id)
    {
        return $this->where(['id' => $id])->get();
---
SELECT *
FROM `edukasi`
WHERE `id` = '1'